uhnp/src/DataProcessors/КонвертацияБланковВМногопериодные/КонвертацияБланковВМногопериодные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонвертацияБланковВМногопериодные</name>
  <attributes>
    <name>ИсходныйБланк</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертироватьФормулыПравилаОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/Catalogs/БланкиОтчетов/БланкиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БланкиОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>Макет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПоУмолчанию</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчаниюВВидеБланка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскрытиеВМакете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСлева</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСверху</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БланкДляОтображения</name>
    <comment>Данный бланк используется только для отображения, так как не содержит всех ключевых реквизитов аналитик</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаШапки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодвала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСтруктуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСводнойТаблицы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокКолонок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ракурс</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимБланка</name>
    <comment>0 - Однопериодный бланк, 1- Сводная таблица, 2 - Многопериодный бланк</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мультиязычный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ВыводитьНомераСтрок</name>
    <comment>// Юдина (Гутарова) Екатерина 25.09.2024 Выполнение задач №000050931</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_НаименованиеЛистаУдалить</name>
    <comment>№000051650</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_СпециальнаяФормаВыгрузки</name>
    <comment>// Чекордина Ирина 15.08.2025 Выполнение задач №000054725</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_СпециальнаяФормаЗагрузки</name>
    <comment>// Белоконенко Денис 14.08.2025 Выполнение задач №000054780</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МакетРаскрытий</name>
    <comment>Содержит ТЧ частей макета для каждой группы раскрытия</comment>
    <attributes>
      <name>КодГруппыРаскрытия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>45</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Макет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяЧасть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АдресаЭлементовСтруктурыОтчета</name>
    <attributes>
      <name>ТипЭлемента</name>
      <type>
        <types>EnumRef.ЭлементыСтруктурыОтчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.СтрокиОтчетов</types>
        <types>CatalogRef.КолонкиОтчетов</types>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолонкаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресС1К1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеБланки</name>
    <attributes>
      <name>Бланк</name>
      <type>
        <types>CatalogRef.БланкиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КартинкаЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>тн_ИмяЛистовExcel</name>
    <comment>// Белоконенко Денис 20.10.2025 Выполнение задач №000055268</comment>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЛиста</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/КонвертацияБланковВМногопериодные/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
Процедура КонвертироватьОбычныеБланкиВМногоПериодные() Экспорт
	
     Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	БланкиОтчетов.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.БланкиОтчетов КАК БланкиОтчетов
	 |ГДЕ
	 |	БланкиОтчетов.РежимБланка = 0";
	 
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
		 
		  Попытка 
			  
			  Обработки.КонвертацияБланковВМногопериодные.КонвертироватьМакетБланка(Выборка.Ссылка);
  	  
		  Исключение	 
			  
			  ТекстСообщения = НСтр("ru = 'При перезаписи бланка %Бланк% произошла ошибка
			  |			%ОписаниеОшибки%'");
			  ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Бланк%", Строка(Выборка.Ссылка));
			  ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", Строка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			  ЗаписьЖурналаРегистрации(
			  ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			  УровеньЖурналаРегистрации.Ошибка,
			  Метаданные.Справочники.БланкиОтчетов,
			  Выборка.Ссылка, 
			  ТекстСообщения);
			  
			  ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);	
			  
		  КонецПопытки;		 

	 КонецЦикла;
	 
КонецПроцедуры
 
Процедура КонвертироватьМакетБланка(ИсходныйБланк,ПолеТабличногоДокументаМакет = Неопределено) Экспорт
	
	//Конвертируем ячейки показателей
	Владелец 	= ИсходныйБланк.Владелец;
	ВладелецКод = СокрЛП(ИсходныйБланк.Владелец.Код);
	
	Если ПолеТабличногоДокументаМакет = Неопределено Тогда
		ПолеТабличногоДокументаМакет = Новый ТабличныйДокумент;
		тМакет = ИсходныйБланк.Макет.Получить();
		Если НЕ тМакет = Неопределено Тогда
			ПолеТабличногоДокументаМакет.Вывести(тМакет);
		КонецЕсли;	
	КонецЕсли;
	
	Для ИндС = 1 По ПолеТабличногоДокументаМакет.ВысотаТаблицы Цикл
		Для ИндК = 1 По ПолеТабличногоДокументаМакет.ШиринаТаблицы Цикл
			тЯчейка = ПолеТабличногоДокументаМакет.Область(ИндС,ИндК,ИндС,ИндК);
			
			МассивКодов = Новый Массив;
			МассивКодов.Добавить(тЯчейка.Имя);
			СоответствиеСвязей = НастройкиБланкаОтчетаУХ.ПолучитьСтруктуруСсылокНаОбъекты(МассивКодов,Владелец,"Показатель");
			
			Если ТипЗнч(СоответствиеСвязей) = Тип("СправочникСсылка.ПоказателиОтчетов") Тогда	
				
				тЯчейка.СодержитЗначение  = Ложь;
				
				тПоказательКод = СокрЛП(СоответствиеСвязей.Код);
				
				тЯчейка.Текст 			 = ВладелецКод +"."+тПоказательКод;
				тЯчейка.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Обрезать;	
				тЯчейка.Имя 			 = ПолучитьИмяСледующейОбласти(ПолеТабличногоДокументаМакет,ВладелецКод,тПоказательКод); 
				
				СтруктураРасшифровки = Новый Структура();
				СтруктураРасшифровки.Вставить("Ссылка"			,СоответствиеСвязей);			
				тЯчейка.Расшифровка 	 = СтруктураРасшифровки;
				
			ИначеЕсли  тЯчейка.Имя = "Сценарий" Тогда
				тЯчейка.СодержитЗначение  = Ложь;
				тЯчейка.Текст 	= "[Параметры.Сценарий]";
				тЯчейка.Имя 	= "";
			ИначеЕсли  тЯчейка.Имя = "ПериодОтчета" Тогда
				тЯчейка.СодержитЗначение  = Ложь;
				тЯчейка.Текст 	= "[Параметры.ПериодОтчетаНачало]";
				тЯчейка.Имя 	= "";
			ИначеЕсли  тЯчейка.Имя = "ОсновнаяВалюта" Тогда
				тЯчейка.СодержитЗначение  = Ложь;
				тЯчейка.Текст 	= "[Параметры.Валюта]";
				тЯчейка.Имя 	= "";
			ИначеЕсли  тЯчейка.Имя = "Организация" Тогда	
				тЯчейка.СодержитЗначение  = Ложь;
				тЯчейка.Текст 	= "[Параметры.Организация]";
				тЯчейка.Имя 	= "";
			ИначеЕсли  тЯчейка.Имя = "Проект" Тогда
				тЯчейка.СодержитЗначение  = Ложь;
				тЯчейка.Текст 	= "[Параметры.Проект]";
				тЯчейка.Имя 	= "";	
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;	

	//удаляем все лишние именованные области 
	МассивУдаляемыхОбластей = Новый Массив;
	Для Каждого СтрОбл Из ПолеТабличногоДокументаМакет.Области Цикл
		Если СтрОбл.Верх = 0 Или СтрОбл.Лево = 0 Тогда
			 МассивУдаляемыхОбластей.Добавить(СтрОбл);
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого УдОбл Из МассивУдаляемыхОбластей Цикл
		ПолеТабличногоДокументаМакет.Область(УдОбл.Имя).Имя = "";
	КонецЦикла;	
	
	//Для показателей, у которых есть формулы по текущему правилу обработки сделаем конвертацию операндов первого уровня,если выбрана опция 
	//Если Объект.КонвертироватьФормулыПравилаОбработки Тогда
	//	КонвертироватьФормулыВПоказателиБланка();
	//КонецЕсли;
	
	ПроверитьНаличиеСлужебныхОбластей(ПолеТабличногоДокументаМакет,Истина);
	
	//Сохраняем макет как МП Бланк
	БланкОбъект = ИсходныйБланк.ПолучитьОбъект();
	БланкОбъект.РежимБланка = 2;
	БланкОбъект.БланкДляОтображения = Истина;
	БланкОбъект.Записать();
	
	ОбъектАБ = Обработки.АналитическийБланк.Создать();
	Обработки.АналитическийБланк.ПрочитатьНастройкиАналитическогоБланка(ПолеТабличногоДокументаМакет,ИсходныйБланк,ОбъектАБ);	
	ПодготовитьКэшСГруппировками(ПолеТабличногоДокументаМакет,ОбъектАБ);
	
	Отказ = Ложь;				
	Уид   = Новый УникальныйИдентификатор;
	Справочники.БланкиОтчетов.СохранитьМакетМногопериодногоБланка(ИсходныйБланк,ПолеТабличногоДокументаМакет,ОбъектАБ,Уид,Отказ);
	
КонецПроцедуры

Функция ПолучитьИмяСледующейОбласти(ПолеТабличногоДокументаМакет_,ВидОтчета,ПоказательКод)
		
	ТекущееИмя = "ВидОтчета_"+ВидОтчета +"_Показатель_"+ПоказательКод+"_ИндексЯчейки";
	
	ИндексОбласти = 1;
	
	Пока НЕ ПолеТабличногоДокументаМакет_.Области.Найти(ТекущееИмя) = Неопределено Цикл
		ТекущееИмя = "ВидОтчета_"+ВидОтчета +"_Показатель_"+ПоказательКод+"_ИндексЯчейки"+ИндексОбласти;
		ИндексОбласти = ИндексОбласти+1;
	КонецЦикла;	
	
	Возврат ТекущееИмя;
		
КонецФункции

Процедура ПодготовитьКэшСГруппировками(ПолеТабличногоДокументаМакет,ОбъектАБ)
		
	ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Очистить();
	ОбъектАБ.КэшТаблицРаскрываемыхОбластей.Очистить();
	ОбъектАБ.НастройкиТаблицРаскрываемыхОбластей.Очистить();
	
	Для Каждого облРаскрытия Из ОбъектАБ.КэшРаскрываемыхОбластей Цикл			
		ОбластьРаскрытия =  ПолеТабличногоДокументаМакет.Области.Найти(облРаскрытия.ИмяОбласти);		
		ФлВключенияОбласти = Истина;	
		Если Не ОбластьРаскрытия = Неопределено Тогда	
			
			облРаскрытия.Лево = ОбластьРаскрытия.Лево;
			облРаскрытия.Верх = ОбластьРаскрытия.Верх;
			
			//Строки
			Если ОбластьРаскрытия.Лево=0 Тогда		
				Для Каждого ОбластьДляПроверки Из ОбъектАБ.КэшРаскрываемыхОбластей Цикл	
					тОбласть = ПолеТабличногоДокументаМакет.Области.Найти(ОбластьДляПроверки.ИмяОбласти);
					Если тОбласть.Верх<ОбластьРаскрытия.Верх И тОбласть.Низ>=ОбластьРаскрытия.Низ Тогда
						ФлВключенияОбласти = Ложь; Прервать; 	
					КонецЕсли;				
				КонецЦикла;				
				Если ФлВключенияОбласти Тогда
					НобластьКэша = ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Добавить();
					ЗаполнитьЗначенияСвойств(НобластьКэша,облРаскрытия);
					НобластьКэша.Низ =  ОбластьРаскрытия.Низ;
					НобластьКэша.Лево = 9999;		
				КонецЕсли;
			КонецЕсли;		
			//Колонки
			Если ОбластьРаскрытия.Верх=0 Тогда		
				Для Каждого ОбластьДляПроверки Из ОбъектАБ.КэшРаскрываемыхОбластей Цикл
					тОбласть = ПолеТабличногоДокументаМакет.Области.Найти(ОбластьДляПроверки.ИмяОбласти);
					//Если область имеет область - родителя, то игнорируем ее 
					Если тОбласть.Лево<ОбластьРаскрытия.Лево И тОбласть.Право>=ОбластьРаскрытия.Право Тогда
						ФлВключенияОбласти = Ложь; Прервать;						
					КонецЕсли;				
				КонецЦикла;			
				Если ФлВключенияОбласти Тогда
					НобластьКэша = ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Добавить();
					ЗаполнитьЗначенияСвойств(НобластьКэша,облРаскрытия);
					НобластьКэша.Право =  ОбластьРаскрытия.Право;
					НобластьКэша.Верх = 9999;
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;						
	КонецЦикла;	
	
	
	
	
	//Готовим области таблиц
	тСтроки 	= ОбъектАБ.КэшРаскрываемыхОбластей.НайтиСтроки(Новый Структура("Лево",0));
	тКолонки 	= ОбъектАБ.КэшРаскрываемыхОбластей.НайтиСтроки(Новый Структура("Верх",0));
		
	Для Каждого тСтрока Из тСтроки Цикл	
		сНастройкиАналитикРаскрытия = ЗначениеИзСтрокиВнутр(тСтрока.НастройкиАналитикРаскрытия);
		тНастройкиАналитикРаскрытия = сНастройкиАналитикРаскрытия.СкопироватьКолонки();
		тОбластьСтрока              = ПолеТабличногоДокументаМакет.Область(тСтрока.ИмяОбласти);
		
		Для Каждого строкаАналитики Из сНастройкиАналитикРаскрытия Цикл
			тстрокаАналитики = тНастройкиАналитикРаскрытия.Добавить();
			ЗаполнитьЗначенияСвойств(тСтрокаАналитики,строкаАналитики);
		КонецЦикла;	
		Для Каждого тКолонка Из тКолонки Цикл	
			
		    тОбластьКолонка              = ПолеТабличногоДокументаМакет.Область(тКолонка.ИмяОбласти);
			
			кНастройкиАналитикРаскрытия = ЗначениеИзСтрокиВнутр(тКолонка.НастройкиАналитикРаскрытия);
			Для Каждого строкаАналитики Из кНастройкиАналитикРаскрытия Цикл
				тстрокаАналитики = тНастройкиАналитикРаскрытия.Добавить();
				ЗаполнитьЗначенияСвойств(тСтрокаАналитики,строкаАналитики);
			КонецЦикла;			
			нТаблица = ОбъектАБ.КэшТаблицРаскрываемыхОбластей.Добавить();
			нТаблица.УидГруппыОтборов =СтрЗаменить(Новый УникальныйИдентификатор,"-","");
			нТаблица.Лево 	= тОбластьКолонка.Лево;
			нТаблица.Право 	= тОбластьКолонка.Право;
			нТаблица.Верх 	= тОбластьСтрока.Верх;
			нТаблица.Низ 	= тОбластьСтрока.Низ;
			нТаблица.ИмяОбластиСтрок 	= тСтрока.ИмяОбласти;
			нТаблица.ИмяОбластиКолонок = тКолонка.ИмяОбласти;
			нТаблица.НастройкиАналитикРаскрытия = ЗначениеВСтрокуВнутр(тНастройкиАналитикРаскрытия);	
			нТаблица.ИмяОбласти           =  ПолеТабличногоДокументаМакет.Область(нТаблица.Верх,нТаблица.Лево,нТаблица.Низ,нТаблица.Право).Имя;
			
			ОтборРаскрываемойОбластиСтроки  = ОбъектАБ.НастройкиРаскрываемыхОбластей.НайтиСтроки(Новый Структура("УидГруппыОтборов",тСтрока.УидГруппыОтборов));
			ОтборРаскрываемойОбластиКолонки = ОбъектАБ.НастройкиРаскрываемыхОбластей.НайтиСтроки(Новый Структура("УидГруппыОтборов",тКолонка.УидГруппыОтборов));
			
			Для Каждого СтрокаОтбор Из ОтборРаскрываемойОбластиСтроки Цикл
				нОтбор = ОбъектАБ.НастройкиТаблицРаскрываемыхОбластей.Добавить();
				ЗаполнитьЗначенияСвойств(нОтбор,СтрокаОтбор);
				нОтбор.УидГруппыОтборов = нТаблица.УидГруппыОтборов;
			Конеццикла;
			
			Для Каждого СтрокаОтбор Из ОтборРаскрываемойОбластиКолонки Цикл
				нОтбор = ОбъектАБ.НастройкиТаблицРаскрываемыхОбластей.Добавить();
				ЗаполнитьЗначенияСвойств(нОтбор,СтрокаОтбор);
				нОтбор.УидГруппыОтборов = нТаблица.УидГруппыОтборов;
			Конеццикла;

			
		КонецЦикла;		
	КонецЦикла;	
			
   ОбъектАБ.КэшВыводаОбластейМакета.Очистить();	
   Лево =1;
   Верх =1;
   
   ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Сортировать("Верх,Лево");
   КолонкиРаскрытия 	= ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Выгрузить(Новый Структура("Верх",9999));
   СтрокиРаскрытия		= ОбъектАБ.КэшРаскрываемыхОбластейСгруппированный.Выгрузить(Новый Структура("Лево",9999));
   
   нКол  		= КолонкиРаскрытия.Добавить();
   Нкол.Лево    = ПолетабличногоДокументаМакет.ШиринаТаблицы+1;
   Нкол.ИмяОбласти = "МаркерОкончания";
   
   Низ 		= ПолетабличногоДокументаМакет.ВысотаТаблицы;   
   нСтрока  = СтрокиРаскрытия.Добавить();
   нСтрока.Верх    = ПолетабличногоДокументаМакет.ВысотаТаблицы+1;
   нСтрока.ИмяОбласти = "МаркерОкончания";
   
   
   //Для Каждого СтрокаМакета Из  СтрокиРаскрытия Цикл	      
   //    //Между областями есть 'свободные' колонки
   //    Если Верх<>СтрокаМакета.Верх  Тогда   
   // 	   ЗаполнитьКэшВыводаОбластейМакета(ПолеТабличногоДокументаМакет,ОбъектАБ,КолонкиРаскрытия,Верх,СтрокаМакета.Верх,Лево,"Синтетика");
   //    КонецЕсли;
   //    Если СтрокаМакета.ИмяОбласти = "МаркерОкончания" Тогда
   // 	   Продолжить;
   //    КонецЕсли;		   
   //    ЗаполнитьКэшВыводаОбластейМакета(ПолеТабличногоДокументаМакет,ОбъектАБ,КолонкиРаскрытия,СтрокаМакета.Верх,СтрокаМакета.Низ,Лево,"Строки",СтрокаМакета.УидГруппыОтборов);	   
   //    Верх 	        = ?(ПолетабличногоДокументаМакет.ВысотаТаблицы =СтрокаМакета.Низ,ПолетабличногоДокументаМакет.ВысотаТаблицы+1,СтрокаМакета.Низ+1);	   
   //КонецЦикла;	   
    
   
КонецПроцедуры	

Процедура ПроверитьНаличиеСлужебныхОбластей(ПолеТабличногоДокументаМакет,ТихийРежим = Ложь)
	
	МакетСлужебныхОбластей = Справочники.БланкиОтчетов.ПолучитьМакет("ШаблонСлужебныхОбластей");
	
	Если НЕ ПолеТабличногоДокументаМакет.Область(1,0,1,0).Имя =  "ОбластьНастроекРаскрытийКолонок" Тогда
		
		ОбластьИсточник = МакетСлужебныхОбластей.Область("ОбластьНастроекРаскрытийКолонок");
		ОбластьПриемник = ПолеТабличногоДокументаМакет.Область(1,0,1,0);
		ПолеТабличногоДокументаМакет.ВставитьОбласть(ОбластьИсточник,ОбластьПриемник,ТипСмещенияТабличногоДокумента.ПоВертикали);
		
		Если НЕ ТихийРежим Тогда
			ТекстСообщения = НСтр("ru = 'Добавлена служебная область, содержащая настройки раскрытий колонок'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;	
		
	Если НЕ ПолеТабличногоДокументаМакет.Область(0,1,0,1).Имя =  "ОбластьНастроекРаскрытийСтрок" Тогда
		
		ОбластьИсточник = МакетСлужебныхОбластей.Область("ОбластьНастроекРаскрытийСтрок");
		ОбластьПриемник = ПолеТабличногоДокументаМакет.Область(0,1,0,1);
		ПолеТабличногоДокументаМакет.ВставитьОбласть(ОбластьИсточник,ОбластьПриемник,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		
		Если НЕ ТихийРежим Тогда
			ТекстСообщения = НСтр("ru = 'Добавлена служебная область, содержащая настройки раскрытий строк'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецЕсли
